#pragma once
#include <Windows.h>

//     ???????????????????????????????????????????????????????????
//     ?                 Boss Movement Data                      ?
//     ???????????????????????????????????????????????????????????
struct BossMovementData { BYTE Unknown00[0x1C]; int ShellMaxHP; int MaskMaxHP; };

struct Enemy {

    BYTE Unknown0000[0x04];
    DWORD TypeName;                  // +0x0004

    BYTE Unknown0008[0x0C];
    Enemy* Parent;                   // +0x0014

    BYTE Unknown0018[0x02A4];
    short MaxHP;                     // +0x02BC

    BYTE Unknown02BE[0x76];
    short CurrentHP;                 // +0x0334

    BYTE Unknown0336[0x42];
    DWORD EnemyNameUnitxtIndex;      // +0x0378

    BYTE Unknown037C[0x18];

    BYTE JointShellFlags;            // +0x0394
    BYTE Unknown0395[0x07];
    int JointShellHP;                // +0x039C

    BYTE Unknown03A0[0x24];
    BYTE BarbaJointShellFlags;       // +0x03C4
    BYTE Unknown03C5[0x03];
    BYTE MaskFlags;                  // +0x03C8
    BYTE Unknown03C9[0x03];

    int BarbaJointShellHP;           // +0x03CC

    BYTE Unknown03D0[0x258];

    BossMovementData* MovementData;  // +0x0628
    BYTE Unknown062C[0x04];
    BYTE BarbaMaskFlags;             // +0x0630
    BYTE Unknown0631[0x7F];

    int BodyMaxHP;                   // +0x06B0
    int BodyCurrentHP;               // +0x06B4
    int MaskHP;                      // +0x06B8

    BYTE Unknown06BC[0x44];

    int BarbaBodyMaxHP;              // +0x0700
    int BarbaBodyCurrentHP;          // +0x0704
    int BarbaMaskHP;                 // +0x0708
};

//     ???????????????????????????????????????????????????????????
//     ?                 TWindow Lock On                         ?
//     ???????????????????????????????????????????????????????????
    struct TWindowLockOn { 
       BYTE Unknown[0x74]; 
       wchar_t TextBuffer[128]; 
    };